partham20/bu_adc/adc_ex2_soc_epwm/flash_programming_f28p55x.h
//#############################################################################
//
// FILE:   flash_programming_f28p55x.h
//
// TITLE:  A set of Constant Values for the F28P55x Family.
//
//#############################################################################
//
//
// 
// C2000Ware v5.03.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################

#ifndef FLASH_PROGRAMMING_F28P55X_H_
#define FLASH_PROGRAMMING_F28P55X_H_

// Bank0 Sector start addresses
#define FlashBank0StartAddress      0x80000U
#define Bzero_Sector0_start         0x80000U
#define Bzero_Sector1_start         0x80400U
#define Bzero_Sector2_start         0x80800U
#define Bzero_Sector3_start         0x80C00U
#define Bzero_Sector4_start         0x81000U
#define Bzero_Sector5_start         0x81400U
#define Bzero_Sector6_start         0x81800U
#define Bzero_Sector7_start         0x81C00U
#define Bzero_Sector8_start         0x82000U
#define Bzero_Sector9_start         0x82400U
#define Bzero_Sector10_start        0x82800U
#define Bzero_Sector11_start        0x82C00U
#define Bzero_Sector12_start        0x83000U
#define Bzero_Sector13_start        0x83400U
#define Bzero_Sector14_start        0x83800U
#define Bzero_Sector15_start        0x83C00U
#define Bzero_Sector16_start        0x84000U
#define Bzero_Sector17_start        0x84400U
#define Bzero_Sector18_start        0x84800U
#define Bzero_Sector19_start        0x84C00U
#define Bzero_Sector20_start        0x85000U
#define Bzero_Sector21_start        0x85400U
#define Bzero_Sector22_start        0x85800U
#define Bzero_Sector23_start        0x85C00U
#define Bzero_Sector24_start        0x86000U
#define Bzero_Sector25_start        0x86400U
#define Bzero_Sector26_start        0x86800U
#define Bzero_Sector27_start        0x86C00U
#define Bzero_Sector28_start        0x87000U
#define Bzero_Sector29_start        0x87400U
#define Bzero_Sector30_start        0x87800U
#define Bzero_Sector31_start        0x87C00U
#define Bzero_Sector32_start        0x88000U
#define Bzero_Sector33_start        0x88400U
#define Bzero_Sector34_start        0x88800U
#define Bzero_Sector35_start        0x88C00U
#define Bzero_Sector36_start        0x89000U
#define Bzero_Sector37_start        0x89400U
#define Bzero_Sector38_start        0x89800U
#define Bzero_Sector39_start        0x89C00U
#define Bzero_Sector40_start        0x8A000U
#define Bzero_Sector41_start        0x8A400U
#define Bzero_Sector42_start        0x8A800U
#define Bzero_Sector43_start        0x8AC00U
#define Bzero_Sector44_start        0x8B000U
#define Bzero_Sector45_start        0x8B400U
#define Bzero_Sector46_start        0x8B800U
#define Bzero_Sector47_start        0x8BC00U
#define Bzero_Sector48_start        0x8C000U
#define Bzero_Sector49_start        0x8C400U
#define Bzero_Sector50_start        0x8C800U
#define Bzero_Sector51_start        0x8CC00U
#define Bzero_Sector52_start        0x8D000U
#define Bzero_Sector53_start        0x8D400U
#define Bzero_Sector54_start        0x8D800U
#define Bzero_Sector55_start        0x8DC00U
#define Bzero_Sector56_start        0x8E000U
#define Bzero_Sector57_start        0x8E400U
#define Bzero_Sector58_start        0x8E800U
#define Bzero_Sector59_start        0x8EC00U
#define Bzero_Sector60_start        0x8F000U
#define Bzero_Sector61_start        0x8F400U
#define Bzero_Sector62_start        0x8F800U
#define Bzero_Sector63_start        0x8FC00U
#define Bzero_Sector64_start        0x90000U
#define Bzero_Sector65_start        0x90400U
#define Bzero_Sector66_start        0x90800U
#define Bzero_Sector67_start        0x90C00U
#define Bzero_Sector68_start        0x91000U
#define Bzero_Sector69_start        0x91400U
#define Bzero_Sector70_start        0x91800U
#define Bzero_Sector71_start        0x91C00U
#define Bzero_Sector72_start        0x92000U
#define Bzero_Sector73_start        0x92400U
#define Bzero_Sector74_start        0x92800U
#define Bzero_Sector75_start        0x92C00U
#define Bzero_Sector76_start        0x93000U
#define Bzero_Sector77_start        0x93400U
#define Bzero_Sector78_start        0x93800U
#define Bzero_Sector79_start        0x93C00U
#define Bzero_Sector80_start        0x94000U
#define Bzero_Sector81_start        0x94400U
#define Bzero_Sector82_start        0x94800U
#define Bzero_Sector83_start        0x94C00U
#define Bzero_Sector84_start        0x95000U
#define Bzero_Sector85_start        0x95400U
#define Bzero_Sector86_start        0x95800U
#define Bzero_Sector87_start        0x95C00U
#define Bzero_Sector88_start        0x96000U
#define Bzero_Sector89_start        0x96400U
#define Bzero_Sector90_start        0x96800U
#define Bzero_Sector91_start        0x96C00U
#define Bzero_Sector92_start        0x97000U
#define Bzero_Sector93_start        0x97400U
#define Bzero_Sector94_start        0x97800U
#define Bzero_Sector95_start        0x97C00U
#define Bzero_Sector96_start        0x98000U
#define Bzero_Sector97_start        0x98400U
#define Bzero_Sector98_start        0x98800U
#define Bzero_Sector99_start        0x98C00U
#define Bzero_Sector100_start       0x99000U
#define Bzero_Sector101_start       0x99400U
#define Bzero_Sector102_start       0x99800U
#define Bzero_Sector103_start       0x99C00U
#define Bzero_Sector104_start       0x9A000U
#define Bzero_Sector105_start       0x9A400U
#define Bzero_Sector106_start       0x9A800U
#define Bzero_Sector107_start       0x9AC00U
#define Bzero_Sector108_start       0x9B000U
#define Bzero_Sector109_start       0x9B400U
#define Bzero_Sector110_start       0x9B800U
#define Bzero_Sector111_start       0x9BC00U
#define Bzero_Sector112_start       0x9C000U
#define Bzero_Sector113_start       0x9C400U
#define Bzero_Sector114_start       0x9C800U
#define Bzero_Sector115_start       0x9CC00U
#define Bzero_Sector116_start       0x9D000U
#define Bzero_Sector117_start       0x9D400U
#define Bzero_Sector118_start       0x9D800U
#define Bzero_Sector119_start       0x9DC00U
#define Bzero_Sector120_start       0x9E000U
#define Bzero_Sector121_start       0x9E400U
#define Bzero_Sector122_start       0x9E800U
#define Bzero_Sector123_start       0x9EC00U
#define Bzero_Sector124_start       0x9F000U
#define Bzero_Sector125_start       0x9F400U
#define Bzero_Sector126_start       0x9F800U
#define Bzero_Sector127_start       0x9FC00U
#define FlashBank0EndAddress        0x9FFFFU

