partham20/bu_adc/adc_ex2_soc_epwm/flash_programming_f28p55x.h
// Bank4 Sector start addresses
#define FlashBank4StartAddress      0x100000U
#define Bfour_Sector0_start         0x100000U
#define Bfour_Sector1_start         0x100400U
#define Bfour_Sector2_start         0x100800U
#define Bfour_Sector3_start         0x100C00U
#define Bfour_Sector4_start         0x101000U
#define Bfour_Sector5_start         0x101400U
#define Bfour_Sector6_start         0x101800U
#define Bfour_Sector7_start         0x101C00U
#define Bfour_Sector8_start         0x102000U
#define Bfour_Sector9_start         0x102400U
#define Bfour_Sector10_start        0x102800U
#define Bfour_Sector11_start        0x102C00U
#define Bfour_Sector12_start        0x103000U
#define Bfour_Sector13_start        0x103400U
#define Bfour_Sector14_start        0x103800U
#define Bfour_Sector15_start        0x103C00U
#define Bfour_Sector16_start        0x104000U
#define Bfour_Sector17_start        0x104400U
#define Bfour_Sector18_start        0x104800U
#define Bfour_Sector19_start        0x104C00U
#define Bfour_Sector20_start        0x105000U
#define Bfour_Sector21_start        0x105400U
#define Bfour_Sector22_start        0x105800U
#define Bfour_Sector23_start        0x105C00U
#define Bfour_Sector24_start        0x106000U
#define Bfour_Sector25_start        0x106400U
#define Bfour_Sector26_start        0x106800U
#define Bfour_Sector27_start        0x106C00U
#define Bfour_Sector28_start        0x107000U
#define Bfour_Sector29_start        0x107400U
#define Bfour_Sector30_start        0x107800U
#define Bfour_Sector31_start        0x107C00U
#define FlashBank4EndAddress        0x107FFFU

//Bank offset
#define     FlashBankOffset        0x20000U

//Sector length in number of 16bits
#define Sector2KB_u16length   0x400U
#define Bank256KB_u16length   0x20000U

//Sector length in number of 32bits
#define Sector2KB_u32length   0x200U
#define Bank256KB_u32length   0x10000U

//Flash wrapper base address
#define FLASH_WRAPPER_PROGRAM_BASE         0x51000U /*(FLASH0CMD_BASE - 0x1000UL)*/
#define FlashTech_CPU0_BASE_ADDRESS ((Fapi_FmcRegistersType *)FLASH_WRAPPER_PROGRAM_BASE)

//
// FMC Registers, Masks and Values
//
// #define FLASH_O_ACC_EP           0x148U    // Flash Accumulated Erase Pulses
// #define FLASH_O_ERA_PUL          0x136U    // Flash Max Erase Pulses
// #define FLASH_O_OPT              0x144U    // Flash Optimization

// #define FLASH_ERA_PUL_MAX_ERA_PUL_M      0xFFFU  // Flash Max Erase Pulses Mask
// #define OPT_ENABLE                       0x5U    // Flash Optimization Enable
// #define OPT_DISABLE                      0x2U    // Flash Optimization Disable
// #define MAX_ERASE_PULSE                  0x7D0U  // Flash Max Erase Pulses

#endif /* FLASH_PROGRAMMING_F28P55X_H_ */
